/**
 * DESC       : 国元农险理赔 共用表单验证正则
 * AUTHOR     : 国元农险项目组
 * CREATEDATE : 2017/11/23
 * MODIFYLIST : Name           Date           Reason/Contents
 * --------------------------------------------------------
 */
define(function () {
    var regexpConstants = {
        hour: /^(\d|1\d|2[1-4])$/, // 校验只能输入 1 - 24 （包含）数字
        integer: /^[1-9]\d*$/, // 校验只能输入整数
        positiveDecimal: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0\.0+|0$/, // 一个大于等于零的浮点数
        naturalNumber: /^([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0\.0+|0|[1-9]\d*)$/, // 一个大于等于零数字
        positiveNumber: /^([1-9]\d*\.\d*|0\.\d*[1-9]\d*|[1-9]\d*)$/, // 一个大于零数字,正数（包含小数）
        email: /^[a-z\d]+(\.[a-z\d]+)*@([\da-z](-[\da-z])?)+(\.{1,2}[a-z]+)+$/, // 电子邮箱
        postCode: /^\d{6}$/, // 邮编
        qq: /^[1-9][0-9]{4,14}$/, // QQ号码
        Chinese: /^[\u2E80-\u9FFF]+$/, // 汉字
        number: /^[0-9]*$/, // 校验只能输入数字
        telPhoneNumber:/^0{0,1}(1[3-9])[0-9]{9}$/,//移动电话,不加86
        mobilePhone:/^(1[3-9])[0-9]{9}$/,//移动电话,不加86
        code:/^[A-Za-z0-9]+$/,//代码校验；只能输入字母与数字
        phone:/^(1[3-9])[0-9]{9}$|(\d{2,5}-\d{7,8}?)/, //手机和电话号码
        numberSign:/^[0-9_*]*$/, //数字和符号
        letterNumSign:/^[A-Za-z0-9_*]*$/,//字母、数字和符号
        identityType:/^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})([0-9]|X)$/,
        compensateNo: /^[0-9-]*$/, //计算书带'-'判断
        chineseNumber:/^([0-9])*([\u2E80-\u9FFF])+$/, //数字和中文
        data: /^[0-9]{4}-(((0[13578]|(10|12))-(0[1-9]|[1-2][0-9]|3[0-1]))|((0[469]|11)-(0[1-9]|[1-2][0-9]|30))|(02-(0[1-9]|1[0-9]|2[0-8])))$/,
    };
    return regexpConstants
});